Revit 2024 API
StructuralSectionIParallelFlange Class
 Defines parameters for I-shape Parallel Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionIParallelFlange : StructuralSectionGeneralI
Visual Basic
Public Class StructuralSectionIParallelFlange _
	Inherits StructuralSectionGeneralI
Visual C++
public ref class StructuralSectionIParallelFlange : public StructuralSectionGeneralI
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange
See Also
StructuralSectionIParallelFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace